lista de alunos

Desafio:

1) Importe o arquivo alunos.csv e armazene seu conteúdo  em um DataFrame pandas.
2) Visualize as primeiras 7 linhas do DataFrame e as 5 últimas
3) Confira a quantidade linhas e colunas desse DataFrame
4) Explore as colunas do DataFrame e analise  os tipos dos dados presentes em cada coluna.

In [ ]:
Nome,Idade,Notas,Aprovado
Ary,20,7.5,True
Ana,18,,False
Cátia,27,2.5,False
Denis,18,5.0,False
Beto,21,10.0,True
Bruna,23,,False
Dara,21,7.0,True
Carlos,19,6.0,True
Alice,35,5.6,False
Vitor,28,,False
Daniel,21,,False
Igor,24,4.5,False
Sthefanie,26,9.5,True
Mirla,25,9.0,True
Paulo,37,,False
Mylena,29,7.0,True
Lucas,33,,False
Nadia,34,8.0,True

In [9]:
import pandas as pd

In [10]:
# Vizualizar as primeiras 7 linhas


url = "Dataset/Dataset.csv"
dados = pd.read_csv(url,sep=",")
dados.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [11]:
# Vizualizar 5 ultimas linhas do Dataframe

dados.tail(5)

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

In [13]:
# Confira a quantidade de linhas e colunas desse Dataframe

dados.shape

(18, 4)

In [14]:
# Explore as colunas do DataFrame e analise  os tipos dos dados presentes em cada coluna.

dados.info

<bound method DataFrame.info of          Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
1         Ana     18    NaN     False
2       Cátia     27    2.5     False
3       Denis     18    5.0     False
4        Beto     21   10.0      True
5       Bruna     23    NaN     False
6        Dara     21    7.0      True
7      Carlos     19    6.0      True
8       Alice     35    5.6     False
9       Vitor     28    NaN     False
10     Daniel     21    NaN     False
11       Igor     24    4.5     False
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
14      Paulo     37    NaN     False
15     Mylena     29    7.0      True
16      Lucas     33    NaN     False
17      Nadia     34    8.0      True>

In [15]:
dados.columns

Index(['Nome', 'Idade', 'Notas', 'Aprovado'], dtype='object')